3-Sinter_vs_Microchannel_Comparison/1uW_load_envelope/Cu_2p0_s10p5/0/domain1/T
FoamFile
{
    version 2.0; format ascii;
    class volScalarField; location "0/domain1"; object T;
}
dimensions [0 0 0 1 0 0 0];
internalField uniform 0.010;
boundaryField
{
    inlet { type fixedValue; value uniform 0.010; }
    outlet { type inletOutlet; inletValue uniform 0.010; value uniform 0.010; }
    domain1_to_solid_wall
    {
        type compressible::turbulentTemperatureCoupledBaffleMixed;
        Tnbr T; kappaMethod fluidThermo; value uniform 0.012;
    }
}
