3-Sinter_vs_Microchannel_Comparison/1uW_load_envelope/Cu_2p0_s10p5/0/solid_wall/T
FoamFile
{
    version 2.0; format ascii;
    class volScalarField; location "0/solid_wall"; object T;
}
dimensions [0 0 0 1 0 0 0];
internalField uniform 0.0105;
boundaryField
{
    chipFace { type fixedGradient; gradient uniform -1.413863e-06; }
    hotPlate { type zeroGradient; }
    outerY0 { type zeroGradient; }
    outerY3 { type zeroGradient; }
    inlet { type zeroGradient; }
    outlet { type zeroGradient; }
    solid_wall_to_domain1
    {
        type compressible::turbulentTemperatureCoupledBaffleMixed;
        Tnbr T; kappaMethod solidThermo; value uniform 0.02;
    }
    solid_wall_to_domain2
    {
        type compressible::turbulentTemperatureCoupledBaffleMixed;
        Tnbr T; kappaMethod solidThermo; value uniform 0.02;
    }
    solid_wall_to_domain3
    {
        type compressible::turbulentTemperatureCoupledBaffleMixed;
        Tnbr T; kappaMethod solidThermo; value uniform 0.02;
    }
    solid_wall_to_domain4
    {
        type compressible::turbulentTemperatureCoupledBaffleMixed;
        Tnbr T; kappaMethod solidThermo; value uniform 0.02;
    }
    solid_wall_to_domain5
    {
        type compressible::turbulentTemperatureCoupledBaffleMixed;
        Tnbr T; kappaMethod solidThermo; value uniform 0.02;
    }
}
