3-Sinter_vs_Microchannel_Comparison/1uW_load_envelope/Cu_2p0_s10p5/constant/domain1/turbulenceProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/fluid_he";
    object      turbulenceProperties;
}

// Re = rho * U * Dh / mu = 145 * 1e-3 * 1e-3 / 1e-7 = 1.45 — fully laminar
simulationType  laminar;
