3-Sinter_vs_Microchannel_Comparison/1uW_load_envelope/Cu_2p0_s10p5/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          3472;
        startFace       612368;
    }
    outlet
    {
        type            patch;
        nFaces          3472;
        startFace       615840;
    }
    chipFace
    {
        type            wall;
        inGroups        1(wall);
        nFaces          7440;
        startFace       619312;
    }
    hotPlate
    {
        type            wall;
        inGroups        1(wall);
        nFaces          7440;
        startFace       626752;
    }
    outerY0
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1680;
        startFace       634192;
    }
    outerY3
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1680;
        startFace       635872;
    }
)

// ************************************************************************* //
